/**
 *  @file eol_rdm_debug_window.cpp
 *
 *  @date 2024年01月18日 11:11:54 星期一
 *
 *  @author aron566
 *
 *  @copyright Copyright (c) 2024 aron566 <aron566@163.com>.
 *
 *  @brief None.
 *
 *  @details None.
 *
 *  @version v0.0.1 aron566 2024.01.18 12:11 初始版本.
 *
 *  @par 修改日志:
 *  <table>
 *  <tr><th>Date       <th>Version <th>Author  <th>Description
 *  <tr><td>2024-01-18 <td>v0.0.1  <td>aron566 <td>初始版本
 *  </table>
 */
/** Includes -----------------------------------------------------------------*/
/** Private includes ---------------------------------------------------------*/
#include "eol_rdm_debug_window.h"
#include "ui_eol_rdm_debug_window.h"
/** Use C compiler -----------------------------------------------------------*/

/** Private macros -----------------------------------------------------------*/

/** Private typedef ----------------------------------------------------------*/

/** Private constants --------------------------------------------------------*/
/** Public variables ---------------------------------------------------------*/
/** Private variables --------------------------------------------------------*/

/** Private function prototypes ----------------------------------------------*/

/** Private user code --------------------------------------------------------*/

/** Private application code -------------------------------------------------*/
/*******************************************************************************
*
*       Static code
*
********************************************************************************
*/

eol_rdm_debug_window::eol_rdm_debug_window(QWidget *parent) :
    QWidget(parent),
    ui(new Ui::eol_rdm_debug_window)
{
  ui->setupUi(this);
}

eol_rdm_debug_window::~eol_rdm_debug_window()
{
  delete ui;
}

/*
dBsm从-100到-80划分为红色，从-80到-60划分为黄色，从-60到-40划分为绿色，从-40到-20划分为蓝色，从-20到0划分为紫色
*/
/** Public application code --------------------------------------------------*/
/*******************************************************************************
*
*       Public code
*
********************************************************************************
*/
/******************************** End of file *********************************/


